       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGRAM1.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 VERTICAL-SIGN PIC X(2) VALUE '||'.
       01 STAR-SIGN PIC X(40)
                    VALUE '****************************************'.
       01 HORIZONTAL-SIGN PIC X(1) VALUE '='.
       01 SLASH-SIGN PIC X(1) VALUE '/'.
       

       SCREEN SECTION.

       01 INIT-SCREEN.
         03 LINE 1 COLUMN 1 PIC X(40) FROM STAR-SIGN.
         03 LINE 1 COLUMN 41 PIC X(40) FROM STAR-SIGN.
         03 LINE 2 COLUMN 1 PIC XX FROM VERTICAL-SIGN.
         03 LINE 2 COLUMN 79 PIC XX FROM VERTICAL-SIGN.
         03 LINE 3 COLUMN 1 PIC XX FROM VERTICAL-SIGN.
         03 LINE 3 COLUMN 79 PIC XX FROM VERTICAL-SIGN.
         03 LINE 4 COLUMN 1 PIC XX FROM VERTICAL-SIGN.
         03 LINE 4 COLUMN 79 PIC XX FROM VERTICAL-SIGN.
         03 LINE 5 COLUMN 1 PIC XX FROM VERTICAL-SIGN.
         03 LINE 5 COLUMN 79 PIC XX FROM VERTICAL-SIGN.
         03 LINE 6 COLUMN 1 PIC XX FROM VERTICAL-SIGN.
         03 LINE 6 COLUMN 79 PIC XX FROM VERTICAL-SIGN.
         03 LINE 7 COLUMN 1 PIC XX FROM VERTICAL-SIGN.
         03 LINE 7 COLUMN 79 PIC XX FROM VERTICAL-SIGN.
         03 LINE 8 COLUMN 1 PIC XX FROM VERTICAL-SIGN.
         03 LINE 8 COLUMN 79 PIC XX FROM VERTICAL-SIGN.
         03 LINE 9 COLUMN 1 PIC XX FROM VERTICAL-SIGN.
         03 LINE 9 COLUMN 79 PIC XX FROM VERTICAL-SIGN.
         03 LINE 10 COLUMN 1 PIC XX FROM VERTICAL-SIGN.
         03 LINE 10 COLUMN 79 PIC XX FROM VERTICAL-SIGN.
         03 LINE 11 COLUMN 1 PIC XX FROM VERTICAL-SIGN.
         03 LINE 11 COLUMN 79 PIC XX FROM VERTICAL-SIGN.
         03 LINE 12 COLUMN 1 PIC XX FROM VERTICAL-SIGN.
         03 LINE 12 COLUMN 79 PIC XX FROM VERTICAL-SIGN.
         03 LINE 13 COLUMN 1 PIC XX FROM VERTICAL-SIGN.
         03 LINE 13 COLUMN 79 PIC XX FROM VERTICAL-SIGN.
         03 LINE 14 COLUMN 1 PIC XX FROM VERTICAL-SIGN.
         03 LINE 14 COLUMN 79 PIC XX FROM VERTICAL-SIGN.
         03 LINE 15 COLUMN 1 PIC XX FROM VERTICAL-SIGN.
         03 LINE 15 COLUMN 79 PIC XX FROM VERTICAL-SIGN.
         03 LINE 16 COLUMN 1 PIC XX FROM VERTICAL-SIGN.
         03 LINE 16 COLUMN 79 PIC XX FROM VERTICAL-SIGN.
         03 LINE 17 COLUMN 1 PIC XX FROM VERTICAL-SIGN.
         03 LINE 17 COLUMN 79 PIC XX FROM VERTICAL-SIGN.
         03 LINE 18 COLUMN 1 PIC XX FROM VERTICAL-SIGN.
         03 LINE 18 COLUMN 79 PIC XX FROM VERTICAL-SIGN.
         03 LINE 19 COLUMN 1 PIC XX FROM VERTICAL-SIGN.
         03 LINE 19 COLUMN 79 PIC XX FROM VERTICAL-SIGN.
         03 LINE 20 COLUMN 1 PIC X(40) FROM STAR-SIGN.
         03 LINE 20 COLUMN 41 PIC X(40) FROM STAR-SIGN.

       01 WELCOME-SCREEN.
         03 LINE 9 COLUMN 5 PIC XX FROM VERTICAL-SIGN.
         03 LINE 8 COLUMN 6 PIC XX FROM VERTICAL-SIGN.
         03 LINE 7 COLUMN 7 PIC XX FROM VERTICAL-SIGN.
         03 LINE 6 COLUMN 8 PIC XX FROM VERTICAL-SIGN.
         03 LINE 10 COLUMN 6 PIC XX FROM VERTICAL-SIGN.
         03 LINE 11 COLUMN 7 PIC XX FROM VERTICAL-SIGN.
         03 LINE 12 COLUMN 8 PIC XX FROM VERTICAL-SIGN.
         03 LINE 9 COLUMN 7 PIC X FROM HORIZONTAL-SIGN.
         03 LINE 9 COLUMN 8 PIC X FROM HORIZONTAL-SIGN.
         03 LINE 9 COLUMN 9 PIC X FROM HORIZONTAL-SIGN.
         03 LINE 9 COLUMN 10 PIC X FROM HORIZONTAL-SIGN.
         03 LINE 9 COLUMN 11 PIC X FROM HORIZONTAL-SIGN.
         03 LINE 9 COLUMN 12 PIC X FROM HORIZONTAL-SIGN.
         03 LINE 9 COLUMN 13 PIC X FROM HORIZONTAL-SIGN.
         03 LINE 9 COLUMN 14 PIC X FROM HORIZONTAL-SIGN.
         03 LINE 9 COLUMN 15 PIC X FROM HORIZONTAL-SIGN.
         03 LINE 9 COLUMN 16 PIC X FROM HORIZONTAL-SIGN.
         03 LINE 9 COLUMN 17 PIC X FROM HORIZONTAL-SIGN.
         03 LINE 9 COLUMN 18 PIC X FROM HORIZONTAL-SIGN.
         03 LINE 9 COLUMN 19 PIC X FROM HORIZONTAL-SIGN.
         03 LINE 9 COLUMN 20 PIC X FROM HORIZONTAL-SIGN.
         03 LINE 9 COLUMN 21 PIC X FROM HORIZONTAL-SIGN.
         03 LINE 9 COLUMN 22 PIC X FROM HORIZONTAL-SIGN.
         03 LINE 9 COLUMN 23 PIC X FROM HORIZONTAL-SIGN.
         03 LINE 9 COLUMN 24 PIC X FROM HORIZONTAL-SIGN.
         03 LINE 9 COLUMN 25 PIC X FROM HORIZONTAL-SIGN.
         03 LINE 9 COLUMN 26 PIC X FROM HORIZONTAL-SIGN.
         03 LINE 9 COLUMN 27 PIC X FROM HORIZONTAL-SIGN.
         03 LINE 9 COLUMN 28 PIC X FROM HORIZONTAL-SIGN.
         03 LINE 9 COLUMN 29 PIC X FROM HORIZONTAL-SIGN.
         03 LINE 9 COLUMN 30 PIC X FROM HORIZONTAL-SIGN.
         03 LINE 9 COLUMN 31 PIC X FROM HORIZONTAL-SIGN.
         03 LINE 9 COLUMN 32 PIC X FROM HORIZONTAL-SIGN.
         03 LINE 9 COLUMN 33 PIC XX FROM VERTICAL-SIGN.
         03 LINE 8 COLUMN 32 PIC XX FROM VERTICAL-SIGN.
         03 LINE 7 COLUMN 31 PIC XX FROM VERTICAL-SIGN.
         03 LINE 6 COLUMN 30 PIC XX FROM VERTICAL-SIGN.
         03 LINE 10 COLUMN 6 PIC XX FROM VERTICAL-SIGN.
         03 LINE 11 COLUMN 7 PIC XX FROM VERTICAL-SIGN.
         03 LINE 12 COLUMN 8 PIC XX FROM VERTICAL-SIGN.
         03 LINE 10 COLUMN 32 PIC XX FROM VERTICAL-SIGN.
         03 LINE 11 COLUMN 31 PIC XX FROM VERTICAL-SIGN.
         03 LINE 12 COLUMN 30 PIC XX FROM VERTICAL-SIGN.
         03 LINE 9 COLUMN 45 PIC X FROM SLASH-SIGN.

       PROCEDURE DIVISION.
           DISPLAY INIT-SCREEN
           DISPLAY WELCOME-SCREEN

           GOBACK.

       END PROGRAM PROGRAM1.
