       IDENTIFICATION DIVISION.
       PROGRAM-ID. GYM_PROGRAM.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       LINKAGE SECTION.
             

      

       PROCEDURE DIVISION.

           GOBACK.
