       IDENTIFICATION DIVISION.
       PROGRAM-ID. PUSH_PROGRAM.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       LINKAGE SECTION.
         COPY "PUSH_PROGRAM.CPY".


       PROCEDURE DIVISION USING PUSH-PROGRAM.
           DISPLAY SHOULDER-PRESS
           DISPLAY BICEP-CURL
           DISPLAY BENCH-PRESS
           GOBACK.

   
