         01 PUSH-PROGRAM.
         05 SHOULDER-PRESS PIC X(40) VALUE 'SHOULDER'.
         05 BICEP-CURL PIC X(40) VALUE 'BICEP'.
         05 BENCH-PRESS PIC X(40) VALUE 'CHEST'.
