       01 TRAINING-PLAN PIC X(4).
         88 PUSH-PLAN VALUE 'PUSH', 'push'.
         88 PULL-PLAN VALUE 'PULL', 'pull'.
         88 LEGS-PLAN VALUE 'LEGS', 'legs'.
